Repository: meetdomadiya/Thesis
Catalog: omeka/modules/Deduplicate/language/*.po
Languages: fr

source: The module %1$s should be upgraded to version %2$s or later.
fr: Le module %1$s doit être mis à niveau à la version %2$s ou supérieure.

source: Automatic
fr: Automatique

source: Deduplicate
fr: Dédoublonnage

source: The process is done on a selection of %1$sresources%2$s.
fr: Le traitement est réalisé sur une sélection de %1$sressources%2$s.

source: Select a property: all resources with the same value, case insensitively or not, will be removed, except the first.
fr: Choisissez une propriété : toutes les ressources avec la même valeur, avec ou sans casse, seront supprimées, sauf la première.

source: WARNING:
fr: ATTENTION :

source: It is strongly recommended to backup the database and files before processing.
fr: Il est fortement recommandé de sauvegarder la base de données et les fichiers avant de dédoublonner.

source: It is recommended to process on a selected list of resources too.
fr: Il est recommandé de dédoublonner sur une sélection de ressources.

source: The search returned %1$d values with duplicated resources for property %2$s.
fr: La recherche a retourné %1$d valeurs avec des doublons pour la propriété %2$s.

source: [kept]
fr: [conservé]

source: [skipped]
fr: [ignoré]

source: To refine the list, select a property and a value or select %sresources%s directly.
fr: Pour affiner la liste, choisir une propriété et une valeur ou sélectionner les %sressources%s directement.

source: To get a list of resources to merge, select a property and a value or go to %sresources%s to filter them.
fr: Pour obtenir une liste de ressources à fusionner, choisir une propriété et une valeur ou parcourir les %sressources%s pour les filtrer.

source: The query returned a single result.
fr: La requête a retourné un seul résultat.

source: The search returned %1$d resources. Only %2$d first ones are displayed. Other ones won’t be processed.
fr: La recherche a retourné %1$d ressources. Seuls les %2$d premiers sont affichés. Les autres ne seront pas traités.

source: Select the resource to keep and the ones to merge.
fr: Choisir la ressource à conserver et celles à fusionner.

source: Merge mode: remove all duplicate resources and update all linked resources to the one kept.
fr: Mode de fusion : supprimer les ressources en doublon et mettre à jour les ressources liées vers la ressource conservée.

source: Select resource to keep
fr: Choisir la ressource à conserver

source: Keep
fr: Conserver

source: Select resource to merge
fr: Choisir la ressource à fusionner

source: Merge
fr: Fusionner

source: It is now possible to delete duplicates automatically.
fr: Il est désormais possible de supprimer les doublons automatiquement.

source: There is no resource to merge.
fr: Aucune ressource à fusionner.

source: There is no resource #{resource_id} to merge.
fr: Il n’y a aucune ressource #{resource_id} à fusionner.

source: {count} resources have been merged inside resource #{resource_id}.
fr: {count} ressources ont été fusionnées dans la ressource #{resource_id}.

source: Property to deduplicate on
fr: Propriété à dédoublonner

source: Select a property…
fr: Choisir une propriété…

source: Heuristic to find similar values
fr: Heuristique pour identifier les valeurs similaires

source: Equal (exactly)
fr: Égal (exactement)

source: Equal (case insensitive)
fr: Égal (sans casse)

source: Process
fr: Traitement

source: Different algorithms can be used to detect "similar" values.
fr: Différents algorithmes peuvent être utilisés pour détecter les valeurs « similaires ».

source: Equal
fr: Égal

source: Similar text
fr: Texte similaire

source: Levenshtein distance
fr: Distance de Levenshtein

source: A property to deduplicate on is required.
fr: Une propriété sur laquelle dédoublonner est nécessaire.

source: There are no duplicates for the property {property}.
fr: Il n’y a aucun doublon pour la propriété {property}.

source: There are {count} duplicates for the property {property}.
fr: Il y a {count} doublons pour la propriété {property}.

source: {count} resources are duplicated with several values and are kept: {resource_ids}
fr: {count} ressources sont des doublons avec plusieurs valeurs et sont conservés : {resource_ids}

source: Confirm removing duplicates, except the first, by checking the checkbox.
fr: Confirmer la suppression des doublons, sauf les premiers, en cochant la case à cocher.

source: You cannot change property when submitting form.
fr: Vous ne pouvez pas changer la propriété lors de la soumission.

source: No duplicates were removed, because duplicated resources have multiple duplicate values.
fr: Aucun doublon ne sera supprimé, car les doublons ont plusieurs valeurs dupliquées.

source: An error occurred when deleting duplicates: {msg}.
fr: Un erreur est survenue lors de la suppression des doublons : {msg}.

source: Processing deduplication in background (job {link}#{job_id}{link_end}, {link_log}logs{link_end}).
fr: Dédoublonnage lancé en arrière-plan (tâche {link}#{job_id}{link_end}, {link_log}journaux{link_end}).

source: {count} duplicates were removed.
fr: {count} doublons ont été supprimés.

source: The property {property} does not exist.
fr: La propriété {property} n’existe pas.

source: A value to deduplicate on is required.
fr: Une valeur sur laquelle dédoublonner est nécessaire.

source: A property is required to search on.
fr: Une propriété sur laquelle chercher est nécessaire.

source: The string is too long (more than {length} characters).
fr: La chaîne est trop longue (plus de {length} caractères).

source: The query does not find selected resource ids.
fr: La requête n’a pas trouvé les ressources sélectionnées.

source: The query returned no resource.
fr: La requête n’a retourné aucune ressource.

source: There are too many similar values near "{value}". You may filter resources first.
fr: Il y a trop de valeurs proches de « {value} ». Vous pouvez filtrer vos ressources d’abord.

source: There is no existing value for property {property} near "{value}".
fr: Il n’y a aucune valeur pour la propriété {property} qui soit proche de « {value} ».

source: The resource #{resource_id} does not exist.
fr: La ressource #{resource_id} n’existe pas.

source: Some merged resources do not exist.
fr: Certaines ressources fusionnées n’existent pas.

source: The value {value} has too much duplicates and will requires a second deduplication.
fr: La valeur {value} a trop de doublons et nécessitera un second dédoublonnage.

source: Deduplicate all resources
fr: Dédoublonner toutes les ressources

source: Deduplicate all resources automatically
fr: Dédoublonner toutes les ressources automatiquement

source: Deduplicate selected resources
fr: Dédoublonner les ressources

source: Deduplicate selected resources automatically
fr: Dédoublonner les ressources automatiquement
